tap "clojure/tools"
tap "gromgit/fuse"
tap "homebrew/bundle"
tap "homebrew/cask-drivers", "https://mirrors.tuna.tsinghua.edu.cn/git/homebrew/homebrew-cask-drivers.git"
tap "homebrew/cask-fonts", "https://mirrors.tuna.tsinghua.edu.cn/git/homebrew/homebrew-cask-fonts.git"
tap "homebrew/cask-versions", "https://mirrors.tuna.tsinghua.edu.cn/git/homebrew/homebrew-cask-versions.git"
tap "homebrew/command-not-found", "https://mirrors.tuna.tsinghua.edu.cn/git/homebrew/homebrew-command-not-found.git"
tap "homebrew/services"
tap "playcover/playcover"
tap "spring-projects-experimental/spring-cli"
brew "highway"
brew "xz"
brew "glib"
brew "gcc"
brew "cmake"
brew "mpg123"
brew "ffmpeg"
brew "fzf"
brew "go@1.19"
brew "hugo"
brew "lua"
brew "mariadb@10.10", restart_service: true
brew "maven"
brew "neovim"
brew "node@20"
brew "numpy"
brew "openvino"
brew "protobuf"
brew "opencv"
brew "poppler"
brew "postgresql@15", restart_service: true
brew "protoc-gen-go"
brew "protoc-gen-go-grpc"
brew "python-packaging"
brew "redis"
brew "rust"
brew "scons"
brew "sevenzip"
brew "tmux"
brew "tree"
brew "wget"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "spring-projects-experimental/spring-cli/spring-cli"
cask "blender@lts"
cask "cyberduck"
cask "dbeaver-community"
cask "discord"
cask "dotnet-sdk"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "godot-mono"
cask "google-chrome"
cask "intellij-idea-ce"
cask "keka"
cask "kekaexternalhelper"
cask "linearmouse"
cask "microsoft-auto-update"
cask "microsoft-remote-desktop"
cask "obs"
cask "obsidian"
cask "orbstack"
cask "postman"
cask "raycast"
cask "sfm"
cask "squirrel"
cask "visual-studio-code"
cask "vlc"
cask "wezterm"
cask "zulu@21"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-zh-hans"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
